docs/acl/acl-bench-results/raw/S01_complexity/getset_bench.txt
ERROR: ERR admin permission required to perform the command
ERROR: failed to fetch CONFIG from 127.0.0.1:7773
WARN: could not fetch server CONFIG
====== SET ======
  20000 requests completed in 2.97 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

0.00% <= 0.9 milliseconds
0.02% <= 1.0 milliseconds
0.05% <= 1.1 milliseconds
0.06% <= 1.2 milliseconds
0.13% <= 1.3 milliseconds
0.18% <= 1.4 milliseconds
0.32% <= 1.5 milliseconds
0.51% <= 1.6 milliseconds
0.71% <= 1.7 milliseconds
0.89% <= 1.8 milliseconds
1.17% <= 1.9 milliseconds
1.48% <= 2 milliseconds
5.97% <= 3 milliseconds
13.22% <= 4 milliseconds
24.25% <= 5 milliseconds
38.08% <= 6 milliseconds
53.47% <= 7 milliseconds
67.32% <= 8 milliseconds
78.60% <= 9 milliseconds
86.52% <= 10 milliseconds
92.04% <= 11 milliseconds
95.21% <= 12 milliseconds
96.82% <= 13 milliseconds
97.63% <= 14 milliseconds
98.10% <= 15 milliseconds
98.41% <= 16 milliseconds
98.79% <= 17 milliseconds
99.13% <= 18 milliseconds
99.34% <= 19 milliseconds
99.54% <= 20 milliseconds
99.68% <= 21 milliseconds
99.73% <= 22 milliseconds
99.86% <= 23 milliseconds
99.89% <= 24 milliseconds
99.93% <= 25 milliseconds
99.94% <= 26 milliseconds
99.96% <= 27 milliseconds
99.96% <= 29 milliseconds
99.97% <= 31 milliseconds
99.98% <= 37 milliseconds
99.99% <= 38 milliseconds
100.00% <= 39 milliseconds
100.00% <= 40 milliseconds
6743.09 requests per second

====== GET ======
  20000 requests completed in 1.33 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

1.25% <= 1 milliseconds
33.83% <= 2 milliseconds
70.14% <= 3 milliseconds
87.86% <= 4 milliseconds
94.73% <= 5 milliseconds
97.61% <= 6 milliseconds
98.85% <= 7 milliseconds
99.53% <= 8 milliseconds
99.81% <= 9 milliseconds
99.95% <= 10 milliseconds
99.96% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 13 milliseconds
15026.30 requests per second